h2zero/n-able-Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2021 Ryan Powell.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.custom_config=Use custom config file
menu.main_stack=Main task stack size
menu.hs_stack=NimBLE host stack size
menu.role=NimBLE Role
menu.cppDbgLvl=NimBLE debug log level
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant



# nRF51822 variants
###################
Waveshare_BLE400.name=Waveshare BLE400

Waveshare_BLE400.upload.tool=openocd
Waveshare_BLE400.upload.target=nrf51
Waveshare_BLE400.upload.maximum_size=262144

Waveshare_BLE400.bootloader.tool=openocd

Waveshare_BLE400.build.mcu=cortex-m0
Waveshare_BLE400.build.f_cpu=16000000
Waveshare_BLE400.build.board=WAVESHARE_BLE400
Waveshare_BLE400.build.core=nRF5
Waveshare_BLE400.build.variant=Waveshare_BLE400
Waveshare_BLE400.build.variant_system_lib=
Waveshare_BLE400.build.float_flags=
Waveshare_BLE400.build.ldscript=nrf51_{build.chip}.ld
Waveshare_BLE400.build.lfclk_flags=-DUSE_LFXO
Waveshare_BLE400.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DNIMBLE_CPP_DEBUG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Waveshare_BLE400.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Waveshare_BLE400.menu.chip.xxaa.build.chip=xxaa
Waveshare_BLE400.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Waveshare_BLE400.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Waveshare_BLE400.menu.chip.xxac.build.chip=xxac
Waveshare_BLE400.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Waveshare_BLE400.menu.custom_config.disable=Disabled
Waveshare_BLE400.menu.custom_config.enable=Enabled
Waveshare_BLE400.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Waveshare_BLE400.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Waveshare_BLE400.menu.main_stack.768=768
Waveshare_BLE400.menu.main_stack.768.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=768
Waveshare_BLE400.menu.main_stack.896=896
Waveshare_BLE400.menu.main_stack.896.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=896
Waveshare_BLE400.menu.main_stack.1024=1024
Waveshare_BLE400.menu.main_stack.1024.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1024
Waveshare_BLE400.menu.main_stack.1152=1152
Waveshare_BLE400.menu.main_stack.1152.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1152
Waveshare_BLE400.menu.main_stack.1280=1280
Waveshare_BLE400.menu.main_stack.1280.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1280
Waveshare_BLE400.menu.main_stack.1408=1408
Waveshare_BLE400.menu.main_stack.1408.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1408
Waveshare_BLE400.menu.main_stack.1536=1536
Waveshare_BLE400.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Waveshare_BLE400.menu.main_stack.1664=1664
Waveshare_BLE400.menu.main_stack.1664.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1664
Waveshare_BLE400.menu.main_stack.1792=1792
Waveshare_BLE400.menu.main_stack.1792.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1792
Waveshare_BLE400.menu.main_stack.1920=1920
Waveshare_BLE400.menu.main_stack.1920.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1920
Waveshare_BLE400.menu.main_stack.2048=2048
Waveshare_BLE400.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Waveshare_BLE400.menu.main_stack.custom=Custom (config file)
Waveshare_BLE400.menu.main_stack.custom.build.main_stack_flags=

Waveshare_BLE400.menu.hs_stack.1024=1024
Waveshare_BLE400.menu.hs_stack.1024.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1024
Waveshare_BLE400.menu.hs_stack.1152=1152
Waveshare_BLE400.menu.hs_stack.1152.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1152
Waveshare_BLE400.menu.hs_stack.1280=1280
Waveshare_BLE400.menu.hs_stack.1280.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1280
Waveshare_BLE400.menu.hs_stack.1408=1408
Waveshare_BLE400.menu.hs_stack.1408.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1408
Waveshare_BLE400.menu.hs_stack.1536=1536
Waveshare_BLE400.menu.hs_stack.1536.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1536
Waveshare_BLE400.menu.hs_stack.1664=1664
Waveshare_BLE400.menu.hs_stack.1664.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1664
Waveshare_BLE400.menu.hs_stack.1792=1792
Waveshare_BLE400.menu.hs_stack.1792.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1792
Waveshare_BLE400.menu.hs_stack.1920=1920
Waveshare_BLE400.menu.hs_stack.1920.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=1920
Waveshare_BLE400.menu.hs_stack.2048=2048
Waveshare_BLE400.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2048
Waveshare_BLE400.menu.hs_stack.custom=Custom (config file)
Waveshare_BLE400.menu.hs_stack.custom.build.hs_stack_flags=

Waveshare_BLE400.menu.role.all=All
Waveshare_BLE400.menu.role.all.build.nimble_flags=
Waveshare_BLE400.menu.role.periph=Peripheral
Waveshare_BLE400.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Waveshare_BLE400.menu.role.adv=Advertiser
Waveshare_BLE400.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Waveshare_BLE400.menu.role.scan=Scanner
Waveshare_BLE400.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Waveshare_BLE400.menu.role.central=Client
Waveshare_BLE400.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Waveshare_BLE400.menu.cppDbgLvl.none=None
Waveshare_BLE400.menu.cppDbgLvl.none.build.cpp_debug=0
Waveshare_BLE400.menu.cppDbgLvl.error=Error
Waveshare_BLE400.menu.cppDbgLvl.error.build.cpp_debug=1
Waveshare_BLE400.menu.cppDbgLvl.warn=Warn
Waveshare_BLE400.menu.cppDbgLvl.warn.build.cpp_debug=2
Waveshare_BLE400.menu.cppDbgLvl.info=Info
Waveshare_BLE400.menu.cppDbgLvl.info.build.cpp_debug=3
Waveshare_BLE400.menu.cppDbgLvl.debug=Debug
Waveshare_BLE400.menu.cppDbgLvl.debug.build.cpp_debug=4



# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52

Generic_nRF52832.upload.tool=openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.maximum_size=524288

Generic_nRF52832.bootloader.tool=openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=16000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld
Generic_nRF52832.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DNIMBLE_CPP_DEBUG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

