h2zero/n-able-Arduino/boards.txt
BT5032A.menu.custom_config.disable=Disabled
BT5032A.menu.custom_config.enable=Enabled
BT5032A.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BT5032A.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BT5032A.menu.main_stack.1536=1536
BT5032A.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BT5032A.menu.main_stack.2048=2048
BT5032A.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BT5032A.menu.main_stack.2560=2560
BT5032A.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BT5032A.menu.main_stack.3072=3072
BT5032A.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BT5032A.menu.main_stack.3584=3584
BT5032A.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BT5032A.menu.main_stack.4096=4096
BT5032A.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BT5032A.menu.main_stack.custom=Custom (config file)
BT5032A.menu.main_stack.custom.build.main_stack_flags=

BT5032A.menu.hs_stack.2048=2048
BT5032A.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2048
BT5032A.menu.hs_stack.2560=2560
BT5032A.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2560
BT5032A.menu.hs_stack.3072=3072
BT5032A.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3072
BT5032A.menu.hs_stack.3584=3584
BT5032A.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3584
BT5032A.menu.hs_stack.4096=4096
BT5032A.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096
BT5032A.menu.hs_stack.custom=Custom (config file)
BT5032A.menu.hs_stack.custom.build.hs_stack_flags=

BT5032A.menu.role.all=All
BT5032A.menu.role.all.build.nimble_flags=
BT5032A.menu.role.periph=Peripheral
BT5032A.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5032A.menu.role.adv=Advertiser
BT5032A.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5032A.menu.role.scan=Scanner
BT5032A.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5032A.menu.role.central=Client
BT5032A.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5032A.menu.cppDbgLvl.none=None
BT5032A.menu.cppDbgLvl.none.build.cpp_debug=0
BT5032A.menu.cppDbgLvl.error=Error
BT5032A.menu.cppDbgLvl.error.build.cpp_debug=1
BT5032A.menu.cppDbgLvl.warn=Warn
BT5032A.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5032A.menu.cppDbgLvl.info=Info
BT5032A.menu.cppDbgLvl.info.build.cpp_debug=3
BT5032A.menu.cppDbgLvl.debug=Debug
BT5032A.menu.cppDbgLvl.debug.build.cpp_debug=4



# nRF52840 variants
###################

BT5040.name=E104-BT5040

BT5040.upload.tool=openocd
BT5040.upload.target=nrf52
BT5040.upload.maximum_size=913408

BT5040.bootloader.tool=openocd

BT5040.build.mcu=cortex-m4
BT5040.build.f_cpu=64000000
BT5040.build.board=BT5040
BT5040.build.core=nRF5
BT5040.build.variant=BT5040
BT5040.build.variant_system_lib=
BT5040.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5040.build.ldscript=nrf52840_dongle.ld
BT5040.build.vid=0x239A
BT5040.build.pid=0x8029
BT5040.build.lfclk_flags=-DUSE_LFXO
BT5040.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DUSB_VID={build.vid} -DUSB_PID={build.pid} -DNIMBLE_CPP_DEBUG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BT5040.menu.custom_config.disable=Disabled
BT5040.menu.custom_config.enable=Enabled
BT5040.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BT5040.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BT5040.menu.main_stack.1536=1536
BT5040.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BT5040.menu.main_stack.2048=2048
BT5040.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BT5040.menu.main_stack.2560=2560
BT5040.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BT5040.menu.main_stack.3072=3072
BT5040.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BT5040.menu.main_stack.3584=3584
BT5040.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BT5040.menu.main_stack.4096=4096
BT5040.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BT5040.menu.main_stack.custom=Custom (config file)
BT5040.menu.main_stack.custom.build.main_stack_flags=

BT5040.menu.hs_stack.2048=2048
BT5040.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2048
BT5040.menu.hs_stack.2560=2560
BT5040.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2560
BT5040.menu.hs_stack.3072=3072
BT5040.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3072
BT5040.menu.hs_stack.3584=3584
BT5040.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3584
BT5040.menu.hs_stack.4096=4096
BT5040.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096
BT5040.menu.hs_stack.custom=Custom (config file)
BT5040.menu.hs_stack.custom.build.hs_stack_flags=

BT5040.menu.role.all=All
BT5040.menu.role.all.build.nimble_flags=
BT5040.menu.role.periph=Peripheral
BT5040.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5040.menu.role.adv=Advertiser
BT5040.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5040.menu.role.scan=Scanner
BT5040.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5040.menu.role.central=Client
BT5040.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5040.menu.cppDbgLvl.none=None
BT5040.menu.cppDbgLvl.none.build.cpp_debug=0
BT5040.menu.cppDbgLvl.error=Error
BT5040.menu.cppDbgLvl.error.build.cpp_debug=1
BT5040.menu.cppDbgLvl.warn=Warn
BT5040.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5040.menu.cppDbgLvl.info=Info
BT5040.menu.cppDbgLvl.info.build.cpp_debug=3
BT5040.menu.cppDbgLvl.debug=Debug
BT5040.menu.cppDbgLvl.debug.build.cpp_debug=4



