h2zero/n-able-Arduino/boards.txt
# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.maximum_size=524288

Generic_nRF52833.bootloader.tool=openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=64000000
Generic_nRF52833.build.board=GENERIC
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld
Generic_nRF52833.build.extra_flags=-DNRF52_SERIES DNRF52833_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DNIMBLE_CPP_DEBUG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52833.menu.custom_config.disable=Disabled
Generic_nRF52833.menu.custom_config.enable=Enabled
Generic_nRF52833.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
Generic_nRF52833.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

Generic_nRF52833.menu.main_stack.1536=1536
Generic_nRF52833.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
Generic_nRF52833.menu.main_stack.2048=2048
Generic_nRF52833.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
Generic_nRF52833.menu.main_stack.2560=2560
Generic_nRF52833.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
Generic_nRF52833.menu.main_stack.3072=3072
Generic_nRF52833.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
Generic_nRF52833.menu.main_stack.3584=3584
Generic_nRF52833.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
Generic_nRF52833.menu.main_stack.4096=4096
Generic_nRF52833.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
Generic_nRF52833.menu.main_stack.custom=Custom (config file)
Generic_nRF52833.menu.main_stack.custom.build.main_stack_flags=

Generic_nRF52833.menu.hs_stack.2048=2048
Generic_nRF52833.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2048
Generic_nRF52833.menu.hs_stack.2560=2560
Generic_nRF52833.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2560
Generic_nRF52833.menu.hs_stack.3072=3072
Generic_nRF52833.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3072
Generic_nRF52833.menu.hs_stack.3584=3584
Generic_nRF52833.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3584
Generic_nRF52833.menu.hs_stack.4096=4096
Generic_nRF52833.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096
Generic_nRF52833.menu.hs_stack.custom=Custom (config file)
Generic_nRF52833.menu.hs_stack.custom.build.hs_stack_flags=

Generic_nRF52833.menu.role.all=All
Generic_nRF52833.menu.role.all.build.nimble_flags=
Generic_nRF52833.menu.role.periph=Peripheral
Generic_nRF52833.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52833.menu.role.adv=Advertiser
Generic_nRF52833.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52833.menu.role.scan=Scanner
Generic_nRF52833.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52833.menu.role.central=Client
Generic_nRF52833.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52833.menu.cppDbgLvl.none=None
Generic_nRF52833.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52833.menu.cppDbgLvl.error=Error
Generic_nRF52833.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52833.menu.cppDbgLvl.warn=Warn
Generic_nRF52833.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52833.menu.cppDbgLvl.info=Info
Generic_nRF52833.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52833.menu.cppDbgLvl.debug=Debug
Generic_nRF52833.menu.cppDbgLvl.debug.build.cpp_debug=4



BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.maximum_size=524288
BBCmicrobitV2.upload.setup_command=transport select swd;
BBCmicrobitV2.upload.use_1200bps_touch=false
BBCmicrobitV2.upload.wait_for_upload_port=false
BBCmicrobitV2.upload.native_usb=false

BBCmicrobitV2.bootloader.tool=openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld
BBCmicrobitV2.build.lfclk_flags=-DUSE_LFSYNT
BBCmicrobitV2.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_TINYUSB -D__STACK_SIZE=2048 -DUSB_VID={build.vid} -DUSB_PID={build.pid} -DNIMBLE_CPP_DEBUG_LEVEL={build.cpp_debug} {build.main_stack_flags} {build.hs_stack_flags} {build.nimble_flags}

BBCmicrobitV2.menu.custom_config.disable=Disabled
BBCmicrobitV2.menu.custom_config.enable=Enabled
BBCmicrobitV2.menu.custom_config.enable.compiler.c.extra_flags=-include "{build.source.path}/custom_config.h"
BBCmicrobitV2.menu.custom_config.enable.compiler.cpp.extra_flags=-include "{build.source.path}/custom_config.h"

BBCmicrobitV2.menu.main_stack.1536=1536
BBCmicrobitV2.menu.main_stack.1536.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=1536
BBCmicrobitV2.menu.main_stack.2048=2048
BBCmicrobitV2.menu.main_stack.2048.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2048
BBCmicrobitV2.menu.main_stack.2560=2560
BBCmicrobitV2.menu.main_stack.2560.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=2560
BBCmicrobitV2.menu.main_stack.3072=3072
BBCmicrobitV2.menu.main_stack.3072.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3072
BBCmicrobitV2.menu.main_stack.3584=3584
BBCmicrobitV2.menu.main_stack.3584.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=3584
BBCmicrobitV2.menu.main_stack.4096=4096
BBCmicrobitV2.menu.main_stack.4096.build.main_stack_flags=-DCONFIG_MAIN_TASK_STACK_SIZE=4096
BBCmicrobitV2.menu.main_stack.custom=Custom (config file)
BBCmicrobitV2.menu.main_stack.custom.build.main_stack_flags=

BBCmicrobitV2.menu.hs_stack.2048=2048
BBCmicrobitV2.menu.hs_stack.2048.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2048
BBCmicrobitV2.menu.hs_stack.2560=2560
BBCmicrobitV2.menu.hs_stack.2560.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=2560
BBCmicrobitV2.menu.hs_stack.3072=3072
BBCmicrobitV2.menu.hs_stack.3072.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3072
BBCmicrobitV2.menu.hs_stack.3584=3584
BBCmicrobitV2.menu.hs_stack.3584.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=3584
BBCmicrobitV2.menu.hs_stack.4096=4096
BBCmicrobitV2.menu.hs_stack.4096.build.hs_stack_flags=-DCONFIG_BT_NIMBLE_TASK_STACK_SIZE=4096
BBCmicrobitV2.menu.hs_stack.custom=Custom (config file)
BBCmicrobitV2.menu.hs_stack.custom.build.hs_stack_flags=

BBCmicrobitV2.menu.role.all=All
BBCmicrobitV2.menu.role.all.build.nimble_flags=
BBCmicrobitV2.menu.role.periph=Peripheral
BBCmicrobitV2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobitV2.menu.role.adv=Advertiser
BBCmicrobitV2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobitV2.menu.role.scan=Scanner
BBCmicrobitV2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobitV2.menu.role.central=Client
BBCmicrobitV2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobitV2.menu.cppDbgLvl.none=None
BBCmicrobitV2.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobitV2.menu.cppDbgLvl.error=Error
BBCmicrobitV2.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobitV2.menu.cppDbgLvl.warn=Warn
BBCmicrobitV2.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobitV2.menu.cppDbgLvl.info=Info
BBCmicrobitV2.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobitV2.menu.cppDbgLvl.debug=Debug
BBCmicrobitV2.menu.cppDbgLvl.debug.build.cpp_debug=4
